sograindustries/nrf52_fw/projects/proto_fw_argos/src/main.c
typedef enum {
  // System Commands
  ADS_CMND_WAKEUP    = 0x02,   // Wake-up from standby mode
  ADS_CMND_STANDBY   = 0x04,   // Enter standby mode
  ADS_CMND_RESET_CMD = 0x06,   // Reset the device registers
  ADS_CMND_START     = 0x08,   // Start/restart (synchronize) conversions
  ADS_CMND_STOP      = 0x0A,   // Stop conversion
  ADS_CMND_OFFSETCAL = 0x1A,   // Channel offset calibration - needs to be sent every time there is a change to the PGA gain
  // Data Read Commands
  ADS_CMND_RDATAC    = 0x10,   // Enable Read Data Continuous mode.
                               // - This mode is the default mode at power-up.
  ADS_CMND_SDATAC    = 0x11,   // Stop Read Data Continuously mode
  ADS_CMND_RDATA     = 0x12,   // Read data by command; supports multiple read back.
  // Register Read/Write Commands
  ADS_CMND_RREG      = 0x20,   // Read n nnnn registers starting at address r rrrr
                               //  - first byte 001r rrrr (2xh)(2) - second byte 000n nnnn(2)
  ADS_CMND_WREG      = 0x40    // Write n nnnn registers starting at address r rrrr
                               //  - first byte 010r rrrr (2xh)(2) - second byte 000n nnnn(2)
} ADS1x9xCommand_t;


/**
 * @brief SPI user event handler.
 * @param event
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event,
                       void *                    p_context)
{
    spi_xfer_done = true;
//    NRF_LOG_INFO("Transfer completed.");
//    NRF_LOG_INFO(" Received:");
//    NRF_LOG_HEXDUMP_INFO(m_rx_buf, 16);
    
}

void WriteRegister(uint8_t address, uint8_t value) {
  memset(m_tx_buf, 0, 16);
  memset(m_rx_buf, 0, 16);
  spi_xfer_done = false;
  m_tx_buf[0] = 0x40 + address;
  m_tx_buf[1] = 1;
  m_tx_buf[2] = value;

  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, 16, m_rx_buf, 3));

  while (!spi_xfer_done) {
    __WFE();
  }

  return;
}

uint8_t ReadRegister(uint8_t address) {
  memset(m_tx_buf, 0, 16);
  memset(m_rx_buf, 0, 16);
  spi_xfer_done = false;
  m_tx_buf[0] = 0x20 + address;
  m_tx_buf[1] = 1;

  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, 16, m_rx_buf, 3));

  while (!spi_xfer_done) {
    __WFE();
  }

  return m_rx_buf[2];
}

void DebugWriteRegister(uint8_t address, uint8_t value) {
    uint8_t debug_value;
    debug_value = ReadRegister(address);
    NRF_LOG_INFO("Value %d: %x", address, debug_value);
    WriteRegister(address, value);
    debug_value = ReadRegister(address);
    NRF_LOG_INFO("Value %d: %x", address, debug_value);
    NRF_LOG_FLUSH();
}

void SendCommand(uint8_t op_code){
  memset(m_tx_buf, 0, 16);
  memset(m_rx_buf, 0, 16);
  spi_xfer_done = false;
  m_tx_buf[0] = op_code;
  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, 16, m_rx_buf, 1));

  while (!spi_xfer_done) {
    __WFE();
  }

  return;  
}

int32_t GetData() {
  int32_t raw_value;
  memset(m_tx_buf, 0, 16);
  memset(m_rx_buf, 0, 16);
  spi_xfer_done = false;
  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, 6, m_rx_buf, 6));

  while (!spi_xfer_done) {
    __WFE();
  }

  raw_value = 0;
  if (m_rx_buf[3] & 0x80) {
    raw_value = 0xff;
  }
  raw_value <<= 8;
  raw_value += m_rx_buf[3];
  raw_value <<= 8;
  raw_value += m_rx_buf[4];
  raw_value <<= 8;
  raw_value += m_rx_buf[5];
  return raw_value;
}

LPFilter filter;
volatile bool new_data = false;

void drdy_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  new_data = true;
}

void InitADS() {
 uint32_t error_code;
 // Sets up the reset pin
  nrf_gpio_cfg_output(ADS_RST_PIN);
  nrf_gpio_pin_write(ADS_RST_PIN, 0);

  nrf_gpio_cfg_output(ADS_START_PIN);
  nrf_gpio_pin_write(ADS_START_PIN, 0);
  
  nrf_gpio_cfg_output(ADS_CLKSEL_PIN);
  nrf_gpio_pin_write(ADS_CLKSEL_PIN, 1);

  //nrf_gpio_cfg_input(DRDY_PIN, NRF_GPIO_PIN_PULLDOWN);
  error_code = nrf_drv_gpiote_init();
  if (error_code != NRF_SUCCESS ){
    NRF_LOG_DEBUG("Driver init failed!");
    NRF_LOG_FLUSH();
  }

  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
  in_config.pull = NRF_GPIO_PIN_PULLDOWN;
  error_code = nrf_drv_gpiote_in_init(ADS_DRDY_PIN, &in_config, drdy_handler);
  if (error_code != NRF_SUCCESS ){
    NRF_LOG_DEBUG("Init failed!");
    NRF_LOG_FLUSH();
  }
  
  nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
  spi_config.ss_pin = ADS_CSN_PIN;
  spi_config.miso_pin = ADS_MISO_PIN;
  spi_config.mosi_pin = ADS_MOSI_PIN;
  spi_config.sck_pin = ADS_SCK_PIN;
  spi_config.mode = NRF_DRV_SPI_MODE_1;
 // spi_config.frequency = NRF_DRV_SPI_FREQ_500K;
  spi_config.frequency = NRF_DRV_SPI_FREQ_1M;
  APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));

  // Inits filter
  LPFilter_init(&filter);

  NRF_LOG_INFO("Configuring ADS");
  NRF_LOG_FLUSH();
  nrf_delay_ms(200);
  nrf_gpio_pin_set(ADS_RST_PIN);
  nrf_delay_ms(1000);
  nrf_gpio_pin_clear(ADS_RST_PIN);
  nrf_delay_ms(10);
  nrf_gpio_pin_set(ADS_RST_PIN);
  nrf_delay_ms(1);
  NRF_LOG_FLUSH();

  // Stop Read Data Continously
  SendCommand(ADS_CMND_SDATAC);
  nrf_delay_ms(100);

  // Sets sampling rate
  DebugWriteRegister(1, 1);
  nrf_delay_ms(20);

  // Enables Internal Reference
  DebugWriteRegister(2, 0b10100000);
  nrf_delay_ms(20);

  // Shorts inputs
//  DebugWriteRegister(4, 0b00000001);
  // Normal Gain 6
  DebugWriteRegister(4, 0b00000000);
  // Normal Gain 12
//  DebugWriteRegister(4, 0b01100000);
  nrf_delay_ms(20);

  // Disables Channel 2
//  DebugWriteRegister(5, 0b10000000);
  nrf_delay_ms(20);

  // Asserts start bit
  SendCommand(ADS_CMND_START);
//  nrf_delay_ms(2000);

  // Start Read data Continouously
  SendCommand(ADS_CMND_RDATAC);
  nrf_delay_ms(1000);
  SendCommand(ADS_CMND_OFFSETCAL);
  NRF_LOG_DEBUG("Running...");
}

int32_t data[1024];
int pointer = 0;
int ma = 0;

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

