sograindustries/nrf52_fw/projects/proto_fw_argos/src/main.c
static uint32_t   ecg_control            = 0;
static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};


const nrf_drv_timer_t TIMER_LED = NRF_DRV_TIMER_INSTANCE(1);

void get_mock_normal_adc(int16_t* data, int length) {
  static int offset = 0;
  for (int ii = 0; ii < length; ii++) {
    data[ii] = mock_normal_data[offset];
    offset++;
    offset %= NORMAL_ADC_SAMPLES;
  }
}

void get_mock_abnormal_adc(int16_t* data, int length) {
  static int offset = 0;
  for (int ii = 0; ii < length; ii++) {
    data[ii] = mock_abnormal_data[offset];
    offset++;
    offset %= ABNORMAL_ADC_SAMPLES;
  }
}

void get_ramp(int16_t* data, int length) {
  static int16_t value = 0;
  for(int ii = 0; ii < length; ii++) {
    data[ii] = value++;
  }
}

void get_constant(int16_t* data, int length, int16_t constant) {
  for(int ii = 0; ii < length; ii++) {
    data[ii] = constant;
  }
}

void update_led(uint8_t mask) {
  for (int ii = 0; ii < 4; ii++) {
    if ((mask >> ii) & 0x1) {
      bsp_board_led_on(ii);
    } else {
      bsp_board_led_off(ii);
    }
  }
}

/**
 * @brief Handler for timer events.
 */
void timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    const uint16_t data_length = 60;
    static uint8_t index = 10;
    uint32_t           err_code;
    static uint32_t timer_count = 0;
    uint32_t status = 0;
    int timer_count_size = sizeof(timer_count);

    ble_arrhythmia_s ble_arrhythmia;
    int16_t ble_arrhythmia_size = sizeof(ble_arrhythmia);
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE1:
            timer_count++;
            ble_ecg_uptime_set(&m_nus, m_conn_handle, timer_count);

            status = 255 - ((timer_count >> 5) % 256);
            ble_ecg_status_set(&m_nus, m_conn_handle, status);

            if (ecg_control & 0x1) {
              switch ((ecg_control >> 1) & 0x3) {
                case 0:
                  get_ramp((int16_t*) data_array, data_length/2);
                  break;
                case 1:
                  get_mock_normal_adc((int16_t*) data_array, data_length/2);
                  break;
                case 2:
                  get_mock_abnormal_adc((int16_t*) data_array, data_length/2);
                  break;
                case 3:
                  get_constant((int16_t*) data_array, data_length/2, 1);
                  break;
                default:
                  break;
              }
              //ble_nus_data_send(&m_nus, data_array, &data_length, m_conn_handle);
            }

            if (((timer_count % 50) == 0) && ((ecg_control >> 7) & 0x1)) {
              NRF_LOG_DEBUG("Arrhythmia!");
              ble_arrhythmia.timestamp = timer_count;
              ble_arrhythmia.arrythmia = 3;
              NRF_LOG_DEBUG("Size: %d", sizeof(ble_arrhythmia));
              ble_ecg_arrhythmia_send(&m_nus, &ble_arrhythmia, &ble_arrhythmia_size, m_conn_handle);
            }

            break;
        default:
            //Do nothing.
            break;
    }
}



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

